ZigaMahne/STM32WBAxx_DFP/CMSIS/SVD/STM32WBA64.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="OTG">
      <name>SEC_OTG</name>
      <baseAddress>0x52040000</baseAddress>
    </peripheral>
    <peripheral>
      <name>PTACONV</name>
      <description>PTACONV register block</description>
      <groupName>PTACONV</groupName>
      <baseAddress>0x48038000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PTACONV_ACTCR</name>
          <displayName>PTACONV_ACTCR</displayName>
          <description>PTACONV active control register</description>
          <addressOffset>0x000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00050014</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TACTIVE</name>
              <description>PTA_ACTIVE setup time in us
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACTPOL</name>
              <description>PTA_ACTIVE polarity
</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>PTA_ACTIVE active high</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>PTA_ACTIVE active low</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TABORT</name>
              <description>PTA_ACTIVE delay to cease an ongoing transmission in us
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ABORTDIS</name>
              <description>Disable PTA_ACTIVE deny to abort an ongoing transmission
</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>PTA_ACTIVE deny will abort an ongoing transmission</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>PTA_ACTIVE deny will not abort an ongoing transmission</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PTACONV_PRICR</name>
          <displayName>PTACONV_PRICR</displayName>
          <description>PTACONV priority control register</description>
          <addressOffset>0x004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TPRIORITY</name>
              <description>Priority valid time in us
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>no time-multiplexed priority information on PTA_STATUS</description>
                  <value>0x00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIPOL</name>
              <description>Priority polarity
</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>priority on PTA_PRIORITY or PTA_STATUS not inverted</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>inverted priority on PTA_PRIORITY or PTA_STATUS</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PTACONV_CR</name>
          <displayName>PTACONV_CR</displayName>
          <description>PTACONV control register</description>
          <addressOffset>0x008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXRXPOL</name>
              <description>PTA_STATUS transmit and receive polarity
</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>PTA_STATUS receive = 0, transmit = 1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>PTA_STATUS receive = 1, transmit = 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GRANTPOL</name>
              <description>PTA_GRANT polarity
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>PTA_GRANT active low</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>PTA_GRANT active high</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
